In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1' : ['X', 'X', 'Y', 'Y', 'Z'],
                    'k2' : ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                    'dataset1' : np.random.randn(5),
                    'dataset2' : np.random.randn(5)})

dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896
1  X   beta  1.401899  1.850223
2  Y  alpha -0.410149 -1.226205
3  Y   beta -0.029296 -0.815050
4  Z  alpha  0.949143  0.231377

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    0.299166
Y   -0.219722
Z    0.949143
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])

month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [7]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    1.401899
    JAN   -0.410149
NY  FEB   -0.029296
    JAN    0.072788
Name: dataset1, dtype: float64

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896
1  X   beta  1.401899  1.850223
2  Y  alpha -0.410149 -1.226205
3  Y   beta -0.029296 -0.815050
4  Z  alpha  0.949143  0.231377

In [9]:
dframe.groupby('k1')[['dataset1', 'dataset2']].mean()

    dataset1  dataset2
k1
X   0.299166  1.281559
Y  -0.219722 -1.020627
Z   0.949143  0.231377

In [10]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.803566  0.712896
   beta   1.401899  1.850223
Y  alpha -0.410149 -1.226205
   beta  -0.029296 -0.815050
Z  alpha  0.949143  0.231377

In [11]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896
1  X   beta  1.401899  1.850223
2  Y  alpha -0.410149 -1.226205
3  Y   beta -0.029296 -0.815050
4  Z  alpha  0.949143  0.231377

In [12]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896
1  X   beta  1.401899  1.850223


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.410149 -1.226205
3  Y   beta -0.029296 -0.815050


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.949143  0.231377

In [21]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print("Key1 = %s Key2 = %s" %(k1, k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  1.401899  1.850223


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.410149 -1.226205


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.029296  -0.81505


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.949143  0.231377

In [22]:
group_dict = dict(list(dframe.groupby('k1')))

In [24]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.803566  0.712896
1  X   beta  1.401899  1.850223

In [27]:
type(group_dict['X'])
#That’s because the values stored in the dictionary are not plain 
# values — they are DataFrames (created by the groupby() operation).

pandas.core.frame.DataFrame

In [28]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [ ]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.803566  0.712896
 1  1.401899  1.850223
 2 -0.410149 -1.226205
 3 -0.029296 -0.815050
 4  0.949143  0.231377,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [32]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.712896
   beta   1.850223
Y  alpha -1.226205
   beta  -0.815050
Z  alpha  0.231377